In [1]:
import pandas as pd
import numpy as np 
import datetime

In [5]:
####Reading the order dataset
orders = pd.read_csv("Input/orders.csv")
orders

,order_acknowledged_at,order_ready_at,order_value_gbp,restaurant_id,number_of_items,prep_time_seconds
0,2015-06-01 12:28:28.952789+01:00,2015-06-01 14:12:09.474896+01:00,59.90000,1326,2,6220
1,2015-06-06 17:06:24.434807+01:00,2015-06-06 17:16:27.520253+01:00,24.00000,1326,8,603
2,2015-06-08 14:56:15.503204+01:00,2015-06-08 15:03:39.397496+01:00,15.25000,1326,3,443
3,2015-06-12 15:12:20.497925+01:00,2015-06-12 15:23:30.064683+01:00,28.05000,1326,8,669
4,2015-06-01 13:07:10.794050+01:00,2015-06-01 14:02:25.104517+01:00,56.30000,255,7,3314
...,...,...,...,...,...,...
32389,2015-06-30 21:00:29.131078+01:00,2015-06-30 21:15:42.809359+01:00,35.15000,3185,4,913
32390,2015-06-30 22:30:51.123180+02:00,2015-06-30 22:34:12.850308+02:00,9.15771,3556,3,201
32391,2015-06-30 21:50:11.585362+01:00,2015-06-30 22:04:35.205075+01:00,18.20000,3517,3,863
32392,2015-06-30 22:17:55.778938+01:00,2015-06-30 22:40:15.487549+01:00,21.50000,1705,3,1339
32393,2015-06-30 22:55:39.128579+01:00,2015-06-30 23:18:44.692012+01:00,15.90000,2274,3,1385

In [6]:
####Reading the restaurants dataset
rest = pd.read_csv("Input/restaurants.csv")
rest

      restaurant_id  country         city type_of_food
0                 3       UK       London         thai
1                 5       UK       London      italian
2                 7       UK       London      italian
3                 8       UK       London      chinese
4                 9   France        Paris       korean
...             ...      ...          ...          ...
1692           3594       UK        Leeds        sushi
1693           3614   France        Paris   indonesian
1694           3618  Ireland       Dublin    pan asian
1695           3620       UK  Southampton     burritos
1696           3622       UK   Manchester    caribbean

[1697 rows x 4 columns]

In [14]:
####Understanding the datasets
print("Total number of unique restaurants in the order dataset =",len(orders["restaurant_id"].unique()))
print("\nTotal number of unique restaurants in the restaurant dataset =",len(rest["restaurant_id"].unique()))
print("\nUnique countries in the restaurant dataset =",rest["country"].unique())
print("\nTotal number of unique cities in the restaurant dataset =",len(rest["city"].unique()),"\nCities: ",rest["city"].unique())
print("\nTotal number of unique type of food in the restaurant dataset =",len(rest["type_of_food"].unique()))

Total number of unique restaurants in the order dataset = 1697

Total number of unique restaurants in the restaurant dataset = 1697

Unique countries in the restaurant dataset = ['UK' 'France' 'Ireland' 'Germany']

Total number of unique cities in the restaurant dataset = 22
Cities:  ['London' 'Paris' 'Brighton' 'Manchester' 'Oxford' 'Cambridge' 'Reading'
 'Birmingham' 'Bristol' 'Dublin' 'Berlin' 'Nottingham' 'Liverpool' 'Leeds'
 'Edinburgh' 'Glasgow' 'Guildford' 'München' 'Cheltenham' 'Leicester'
 'Cardiff' 'Southampton']

Total number of unique type of food in the restaurant dataset = 83